/*********************************************************************************************************************


	◆◆◆ IDIO 디자인 셋팅 파일입니다. 반드시 아래 내용 숙지 후 수정해 주세요! ◆◆◆

	- 반드시 작은 따옴표('') 안 문구만 수정해서 사용해 주세요.
	- 따옴표 안 문구를 제외한 여타 내용(괄호, 따옴표, 기타 텍스트 등) 변경이나 삭제시 사이트 전체에 오류를 일으킬 수 있습니다.
	- 따옴표 안 따옴표, 줄바꿈 사용시 오류가 발생합니다. 가급적 특수문자가 없는 텍스트를 입력해서 사용해 주세요.
	- 진열 여부 설정은 on/off 중 택일하여 기입해 주세요. (ex. 'on', 'off')
	- 내용 수정 후 적용된 화면 확인 시에는 반드시 인터넷 쿠키를 삭제하고 새로고침(F5)해 주세요.(★★★★★)

	※ 본 파일은 디자인 내 간단한 텍스트, 영역별 진열 여부를 변경하는 용도이며, 세부적인 디자인 수정은 불가능합니다.
	※ 오류 발생 시, 초기 파일 복구는 '/디자인폴더/_idio/js/' 폴더 안 setup_backup.js를 활용해 주세요.


*********************************************************************************************************************/




/* ■ 메인페이지 기본셋팅 ■ */


/*--------------------------------------------------------------------------------------------------------------------

▶ A-메인배너 사용 여부

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-mainBnr'] = 'on';



/*--------------------------------------------------------------------------------------------------------------------

▶ B-배너영역 사용 여부

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-bnrArea1'] = 'on';



/*--------------------------------------------------------------------------------------------------------------------

▶ C-일반 상품 리스트1 설정
- class-prdArea1 : 해당 리스트 진열 여부
- class-prdArea1-ul : 열수 지정 (grid2~grid5 중 택일, 한 칸 띄고 gallery 기입시 갤러리 타입으로 사용 가능)
- text-prdArea1-tit : 타이틀
- text-prdArea1-tit : 서브 문구

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-prdArea1'] = 'on';
IDIO['class-prdArea1-ul'] = 'grid4';
IDIO['text-prdArea1-tit'] = 'murmure best';
IDIO['text-prdArea1-copy'] = '일반 상품 리스트1입니다. 타이틀과 서브 문구 교체가 가능합니다.';



/*--------------------------------------------------------------------------------------------------------------------

▶ D-탭형식 상품 리스트 설정 ※ 키워드 갯수 조정 불가
- class-prdTab : 해당 리스트 진열 여부
- text-prdTab-tit : 타이틀
- text-prdTab-tit-num : 키워드 텍스트

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-prdTab'] = 'on';
IDIO['text-prdTab-tit-1'] = '뮤르뮤르 베스트';
IDIO['text-prdTab-tit-2'] = 'MD`s pick';
IDIO['text-prdTab-tit-3'] = '투데이 스페셜';
IDIO['text-prdTab-tit-4'] = 'Edited For You';



/*--------------------------------------------------------------------------------------------------------------------

▶ E-일반 상품 리스트2 설정
- class-prdArea2 : 해당 리스트 진열 여부
- class-prdArea2-ul : 열수 지정 (grid2~grid5 중 택일, 한 칸 띄고 gallery 기입시 갤러리 타입으로 사용 가능)
- text-prdArea2-tit : 타이틀
- text-prdArea2-tit : 서브 문구

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-prdArea2'] = 'on';
IDIO['class-prdArea2-ul'] = 'grid3 gallery';
IDIO['text-prdArea2-tit'] = 'murmure special';
IDIO['text-prdArea2-copy'] = '일반 상품 리스트2입니다. 타이틀과 서브 문구 교체가 가능합니다.';



/*--------------------------------------------------------------------------------------------------------------------

▶ G-동영상영역 사용 여부

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-vodArea1'] = 'on';
IDIO['text-vodArea1-tit'] = 'murmure video';
IDIO['text-vodArea1-copy'] = 'VOD 재생 영역입니다. 유튜브 URL을 교체해 주세요!';



/*--------------------------------------------------------------------------------------------------------------------

▶ H-게시판 영역 설정
- class-bbsArea1 : 진열 여부
- text-bbsArea1-tit : 타이틀
- text-bbsArea1-tit : 서브 문구

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-bbsArea1'] = 'on';
IDIO['text-bbsArea1-tit'] = 'news & column';
IDIO['text-bbsArea1-copy'] = '게시판 영역입니다. 칼럼 또는 이벤트 게시판으로 활용해 보세요!';



/*--------------------------------------------------------------------------------------------------------------------

▶ G-인스타그램 위젯 사용 여부

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-insta'] = 'on';



/*--------------------------------------------------------------------------------------------------------------------

▶ H-멀티팝업 사용 여부

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-popup-idio'] = 'on';





/* ■ 기타 공통 항목 기본셋팅 ■ ***/


/*--------------------------------------------------------------------------------------------------------------------

▶ 상단 좌측 스페셜 버튼 설정

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-gnb-btn'] = 'on';
IDIO['text-gnb-btn'] = '신규회원 웰컴 쿠폰10%';
IDIO['href-gnb-btn'] = 'http://www.idio.co.kr/';



/*--------------------------------------------------------------------------------------------------------------------

▶ 상품 썸네일 롤오버시 상세이미지 전환 여부
※ on, off 중 선택하여 기입
※ on 선택시 상세이미지, 목록이미지의 사이즈가 반드시 동일해야 합니다.

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-tmb-over'] = 'off';



/*--------------------------------------------------------------------------------------------------------------------

▶ SNS 버튼 설정
- class-follow : 진열 여부
- href-follow : 연결 URL

--------------------------------------------------------------------------------------------------------------------*/

// 인스타그램
IDIO['class-follow-1'] = 'on';
IDIO['href-follow-1'] = 'http://www.instagram.com/';

// 네이버
IDIO['class-follow-2'] = 'off';
IDIO['href-follow-2'] = '';

// 유튜브
IDIO['class-follow-3'] = 'off';
IDIO['href-follow-3'] = '';

// 트위터
IDIO['class-follow-4'] = 'off';
IDIO['href-follow-4'] = '';

// 페이스북
IDIO['class-follow-5'] = 'on';
IDIO['href-follow-5'] = 'http://www.youtube.com/';



/*--------------------------------------------------------------------------------------------------------------------

▶ 고객센터 운영시간
- text-cstime-1 : 운영시간1
- text-cstime-2 : 운영시간2(휴무일 등 추가정보)

--------------------------------------------------------------------------------------------------------------------*/

IDIO['text-cstime-1'] = '운영시간 : 평일 09:00 ~ 18:00';
IDIO['text-cstime-2'] = '(토, 일, 공휴일 휴무)';



/*--------------------------------------------------------------------------------------------------------------------

▶ 상품 분류 페이지 상품 열수 지정 (grid2~grid5 중 택일)

--------------------------------------------------------------------------------------------------------------------*/

IDIO['class-prdNml'] = 'grid3';
